########################################################################################################################
#
# 1 - Привет, Мир!
#
# Solution:
print('Hello, World!')
#
########################################################################################################################
#
# 2 - Комментарии
#
# Задание:
# Создайте однострочный комментарий с текстом: You know nothing, Jon Snow!
#
# Solution:
#
# # You know nothing, Jon Snow!
#
########################################################################################################################
#
# 3 - Инструкции (Statements)
#
# Задание:
# Выведите на экран друг за другом три имени: Robert, Stannis, Renly. В результате на экране должно отобразиться:
#   Robert
#   Stannis
#   Renly
#
# Solution:
#
print('Robert')
print('Stannis')
print('Renly')
#
########################################################################################################################
#
# 5 - Синтаксические ошибки
#
# Задание:
# Это задание не связано с уроком напрямую. Но будет полезным потренироваться с выводом на экран.
# Выведите на экран What Is Dead May Never Die
#
# Solution:
#
print('What Is Dead May Never Die')
#
########################################################################################################################
