########################################################################################################################

# 6 - Арифметические операции

"""
Задание:
Выведите на экран результат деления числа 81 на 9
"""

# Solution:

print(81 / 9)

########################################################################################################################

# 7 -Операторы

"""
Задание:
Напишите программу, которая посчитает разность между 6 и -81 и выведет ответ на экран
"""

# Solution:

print(6 - (-81))

########################################################################################################################

# 8 - Коммутативная операция

"""
Задание:
Напишите программу, которая считает и выводит на экран последовательно значения следующих математических
выражений: «3 в степени 5» и «-8 разделить на -4»
"""

# Solution:

print(3 ** 5)
print(-8 / -4)

########################################################################################################################

# 9 - Композиция операций

"""
Задание:
Реализуйте программу, которая вычисляет значение выражения 8 / 2 + 5 - -3 / 2. Не вычисляйте ничего самостоятельно,
ваша программа должна производить все вычисления сама
"""

# Solution:

print(((8 / 2) + 5) - (-3 / 2))

########################################################################################################################

# 10 -Приоритет

"""
Задание:
Дано вычисление 70 * 3 + 4 / 8 + 2
Расставьте скобки так, чтобы оба сложения (3 + 4) и (8 + 2) высчитывались в первую очередь
Выведите на экран результат
"""

# Solution:

print((70 * (3 + 4)) / (8 + 2))

########################################################################################################################

# 11 - Линтер

"""
Задание:
Выведите на экран результат следующего вычисления: «разница между пятью в квадрате и произведением трёх
и семи». Напишите код так, чтобы каждый оператор отделялся от операндов пробелами
"""

# Solution:

print((5 ** 2) - (3 * 7))

########################################################################################################################

