########################################################################################################################

# 12 - Кавычки

"""
Задание:
Напишите программу, которая выведет на экран:
"Khal Drogo's favorite word is "athjahakar""
"""

# Solution:

print("\"Khal Drogo's favorite word is \"athjahakar\"\"")

########################################################################################################################

# 13 - Экранирующие последовательности

"""
Задание:
Напишите программу, которая выводит на экран:
  - Did Joffrey agree?
  - He did. He also said "I love using \n"
При этом программа использует только один print, но результат на экране должен выглядеть в точности как показано выше
"""

# Solution:

print("- Did Joffrey agree?\n- He did. He also said \"I love using \\n\".")

########################################################################################################################

# 14 - Конкатенация

"""
Задание:
Выведите на экран#
Winter came for the House of Frey.
используя конкатенацию слов
"""

# Solution

print('Winter ' + 'came ' + 'for ' + 'the ' + 'House ' + 'of ' + 'Frey.')

########################################################################################################################

# 15 - Кодировка

"""
Задание:
В Python можно «запросить» и вывести на экран любой символ из кодировки ASCII. Например:
  print(chr(63))
На экран выведется символ с номером 63 — вопросительный знак ?. Таким способом можно выводить любой символ
Используя пример выше и найденную таблицу, выведите на экран (каждый на своей собственной строке) ~, ^ и %
"""

# Solution:

print(chr(126))
print(chr(94))
print(chr(37))

########################################################################################################################
