########################################################################################################################

# 16 - Типы данных

"""
Задание:
Выведите на экран число -0.304
"""

# Solution:

print(-0.304)

########################################################################################################################

# 17 - Сильная типизация

"""
Задание:
Выведите на экран результат выражения: 7 - (-8 - -2). Попробуйте сделать число 7 не числом, а строкой
"""

# Solution:

print(7 - (-8 - -2))

########################################################################################################################

# 18 - Явное преобразование типов

"""
Задание:
Выведите на экран строку 2 times, полученную из числа 2 и строки times, используя преобразования типов и конкатенацию
"""

# Solution:

print(str(2) + ' times')

########################################################################################################################
